# 面向过程：独立函数，所有数据全部当成参数传来传去
def 存钱(面值, ATM编号, 银行, 纸币编号):
    ...

def 取钱(面值, ATM编号, 银行, 纸币编号):
    ...


# 调用
存钱(50, "001", "招商银行", "AA00000000")
取钱(100, "002", "中国银行", "AA00000001")





#面向对象：定义ATM类
class ATM:
    def __init__(self,编号,银行,支行):
        self.编号=编号
        self.银行=银行
        self.支行=支行
#创建两个ATM对象
atm1=ATM("001","招商银行","南园支行")
atm2=ATM("002","中国银行","北园支行")




#面向对象：定义纸币类
class 纸币:
    def __init__(self, 编号, 面值, 发行年份):
        self.编号 = 编号
        self.面值 = 面值
        self.发行年份 = 发行年份

# 创建两个纸币对象
纸币1 = 纸币("AA00000000", 50, "2015")
纸币2 = 纸币("AA00000001", 100, "2020")
